/**
 * Асинхронды өңдеуші миддлвэр
 * Асинхронды контроллер функцияларын қателерді ұстап, оларды қате миддлвэріне жіберу үшін ораушы
 * 
 * @param {Function} fn - Оралатын асинхронды контроллер функциясы
 * @returns {Function} - Express миддлвэр функциясы
 * 
 * Бұл миддлвэр try-catch блогын әр контроллер үшін қайталап жазу қажеттілігін 
 * болдырмау арқылы кодтың қысқаруына және оқылуын жақсартуға мүмкіндік береді.
 */
const asyncHandler = fn => (req, res, next) => {
  Promise.resolve(fn(req, res, next)).catch(next);
};

module.exports = asyncHandler;